In [14]:
# importing Libraries
"""
this is the section for all the Libraries in the Program
"""

import pandas as pd
import numpy as np
import datetime as dt

## Load the Data

In [16]:
data = pd.read_csv('phone_data.csv')

In [19]:
data.tail()

     index            date  duration  item    month   network network_type
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

In [21]:
data.shape

(830, 7)

In [23]:
data.dtypes

index             int64
date             object
duration        float64
item             object
month            object
network          object
network_type     object
dtype: object

In [24]:
data['date'] = data['date'].apply(pd.to_datetime)
data

In [25]:
data.dtypes

index                    int64
date            datetime64[ns]
duration               float64
item                    object
month                   object
network                 object
network_type            object
dtype: object

In [26]:
data.dtypes

index                    int64
date            datetime64[ns]
duration               float64
item                    object
month                   object
network                 object
network_type            object
dtype: object

## Sumarizing the Data

In [27]:
# try to question yourself various questions while doing the exploratory analysis , like below

data.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [31]:
# how many rows the dataset has

data['index'].count()

print(data['item'].count())

data.shape

830

(830, 7)

In [33]:
# what was the longest Phone call

data['duration'].max()

10528.0

In [42]:
# how many seconds of phone calls are recorded in total

#data['duration']
#data[data['item'] == 'call'].sum()
data['duration'][data['item'] == 'call'].sum()

92321.0

In [36]:
data['item'].value_counts()

call    388
sms     292
data    150
Name: item, dtype: int64

In [47]:
# how many entries are there in each month

data['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [54]:
# Number of non-null unique network entries
data['network'].value_counts()

Three        215
Vodafone     215
data         150
Meteor        87
Tesco         84
landline      42
voicemail     27
world          7
special        3
Name: network, dtype: int64

In [59]:
data['network'].nunique()

9

In [60]:
## all the basic functions that is needed to do almost everytask is builtin, if not only then you have to build a customer function .

## describe() function

In [72]:
data.describe()
#data.describe(include='object')

            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000

## Summarising Groups in the Dataframe.

#### using " groupby()" function in pandas

In [90]:
data.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [91]:
data.groupby('month').groups['2014-11']

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            220, 221, 222, 223, 224, 225, 226, 227, 229, 230],
           dtype='int64', length=230)

## Apply quick mathematical functions to group, which is very handy

In [93]:
# Get the First entry fo reach month

data.groupby('month').first()

         index                date  duration  item   network network_type
month
2014-11      0 2014-10-15 06:58:00    34.429  data      data         data
2014-12    228 2014-11-13 06:58:00    34.429  data      data         data
2015-01    381 2014-12-13 06:58:00    34.429  data      data         data
2015-02    577 2015-01-13 06:58:00    34.429  data      data         data
2015-03    729 2015-12-02 20:15:00    69.000  call  landline     landline

In [94]:
data.groupby('month').last()

         index                date  duration  item   network network_type
month
2014-11    230 2014-11-13 22:31:00     1.000   sms  Vodafone       mobile
2014-12    388 2014-12-14 19:54:00    25.000  call     Three       mobile
2015-01    593 2015-01-14 23:36:00     1.000   sms     Three       mobile
2015-02    728 2015-12-02 06:58:00    34.429  data      data         data
2015-03    829 2015-03-14 00:16:00     1.000   sms     world        world

In [97]:
# Get the sum of the duration per month

data.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [100]:
# get the number of dates / entries in each month

data.groupby('month')['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [108]:
# what is the Sum of duration , for calls only,  to each network

data['duration'][data['item'] == 'call'].sum()

92321.0

In [117]:
data[data['item'] == 'call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

### You can also group by more than one variable, allowing more complex queries.

In [121]:
# How many calls, sms, and data entries are in each month?

data.groupby(['month' , 'item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [122]:
# how many calls, texts and data are sent per month , split by network_type

data.groupby(['month' , 'network_type'])['date'].count()

month    network_type
2014-11  data             29
         landline          5
         mobile          189
         special           1
         voicemail         6
2014-12  data             30
         landline          7
         mobile          108
         voicemail         8
         world             4
2015-01  data             31
         landline         11
         mobile          160
         voicemail         3
2015-02  data             31
         landline          8
         mobile           90
         special           2
         voicemail         6
2015-03  data             29
         landline         11
         mobile           54
         voicemail         4
         world             3
Name: date, dtype: int64

## Groupby output format â€“ Series or DataFrame?

In [127]:
# produces Pandas Series
data.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [124]:
# Produces Pandas DataFrame
data.groupby('month')[['duration']].sum()

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [130]:
data.groupby('month' , as_index = False).agg({"duration":"sum"})

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

In [132]:
# you can use as_index anywhere with froup by, previous example

data.groupby('month' , as_index=False)[['duration']].sum()

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

## Applying a single function to columns in groups

In [135]:
# Group the Dataframae by month and item and extract a number of stats from each group

data.groupby(
    ['month' , 'item']
).agg({
        'duration': 'sum',
        'network_type':'count',
        'date' : 'first'  
     })

               duration  network_type                date
month   item
2014-11 call  25547.000           107 2014-10-15 06:58:00
        data    998.441            29 2014-10-15 06:58:00
        sms      94.000            94 2014-10-16 22:18:00
2014-12 call  13561.000            79 2014-11-14 17:24:00
        data   1032.870            30 2014-11-13 06:58:00
        sms      48.000            48 2014-11-14 17:28:00
2015-01 call  17070.000            88 2014-12-15 20:03:00
        data   1067.299            31 2014-12-13 06:58:00
        sms      86.000            86 2014-12-15 19:56:00
2015-02 call  14416.000            67 2015-01-15 10:36:00
        data   1067.299            31 2015-01-13 06:58:00
        sms      39.000            39 2015-01-15 12:23:00
2015-03 call  21727.000            47 2015-12-02 20:15:00
        data    998.441            29 2015-02-13 06:58:00
        sms      25.000            25 2015-02-19 18:46:00

## Applying multiple functions to columns in groups

In [151]:
# Group the data frame by month and item and extract a number of stats from each group
data.groupby(
    ['month', 'item']
).agg(
    {
        # Find the min, max, and sum of the duration column
        'duration': [min, max, sum],
        # find the number of network type entries
        'network_type': "count",
        # minimum, first, and number of unique dates
        'date': [min, 'first', 'nunique']
    }
)

             duration                       network_type                date  \
                  min        max        sum        count                 min
month   item
2014-11 call    1.000   1940.000  25547.000          107 2014-01-11 15:13:00
        data   34.429     34.429    998.441           29 2014-01-11 06:58:00
        sms     1.000      1.000     94.000           94 2014-03-11 08:40:00
2014-12 call    2.000   2120.000  13561.000           79 2014-02-12 11:40:00
        data   34.429     34.429   1032.870           30 2014-01-12 06:58:00
        sms     1.000      1.000     48.000           48 2014-01-12 12:51:00
2015-01 call    2.000   1859.000  17070.000           88 2014-12-15 20:03:00
        data   34.429     34.429   1067.299           31 2014-12-13 06:58:00
        sms     1.000      1.000     86.000           86 2014-12-15 19:56:00
2015-02 call    1.000   1863.000  14416.000           67 2015-01-02 13:33:00
        data   34.429     34.429   1067.299           31 2015-01-02 06:58:00
        sms     1.000      1.000     39.000           39 2015-01-15 12:23:00
2015-03 call    2.000  10528.000  21727.000           47 2015-01-03 12:19:00
        data   34.429     34.429    998.441           29 2015-01-03 06:58:00
        sms     1.000      1.000     25.000           25 2015-02-03 09:19:00


                           first nunique
month   item
2014-11 call 2014-10-15 06:58:00     104
        data 2014-10-15 06:58:00      29
        sms  2014-10-16 22:18:00      79
2014-12 call 2014-11-14 17:24:00      76
        data 2014-11-13 06:58:00      30
        sms  2014-11-14 17:28:00      41
2015-01 call 2014-12-15 20:03:00      84
        data 2014-12-13 06:58:00      31
        sms  2014-12-15 19:56:00      58
2015-02 call 2015-01-15 10:36:00      67
        data 2015-01-13 06:58:00      31
        sms  2015-01-15 12:23:00      27
2015-03 call 2015-12-02 20:15:00      47
        data 2015-02-13 06:58:00      29
        sms  2015-02-19 18:46:00      17

## Renaming index using droplevel and ravel

In [182]:
grouped = data.groupby('month').agg({
    "duration":['min','max','mean']
})

In [183]:
grouped

        duration
             min      max        mean
month
2014-11      1.0   1940.0  115.823657
2014-12      1.0   2120.0   93.260318
2015-01      1.0   1859.0   88.894141
2015-02      1.0   1863.0  113.301453
2015-03      1.0  10528.0  225.251891

In [185]:
grouped.columns = grouped.columns.droplevel(level = 0)

In [187]:
grouped.head()

         min      max        mean
month
2014-11  1.0   1940.0  115.823657
2014-12  1.0   2120.0   93.260318
2015-01  1.0   1859.0   88.894141
2015-02  1.0   1863.0  113.301453
2015-03  1.0  10528.0  225.251891

In [191]:
grouped.rename(columns={
    "min":"min_duration",
    "max":"max_duration",
    "mean":"mean_duration"
},inplace=True)
grouped.head()

         min_duration  max_duration  mean_duration
month
2014-11           1.0        1940.0     115.823657
2014-12           1.0        2120.0      93.260318
2015-01           1.0        1859.0      88.894141
2015-02           1.0        1863.0     113.301453
2015-03           1.0       10528.0     225.251891

## Ravel MEthod

In [194]:
grouped = data.groupby('month').agg({
    "duration":['min','max','mean']
})
grouped.columns = ["_".join(x) for x in grouped.columns.ravel()]
grouped.head()

         duration_min  duration_max  duration_mean
month
2014-11           1.0        1940.0     115.823657
2014-12           1.0        2120.0      93.260318
2015-01           1.0        1859.0      88.894141
2015-02           1.0        1863.0     113.301453
2015-03           1.0       10528.0     225.251891

In [195]:
# Define the aggregation calculations
aggregations = {
    # work on the "duration" column
    'duration': { 
        # get the sum, and call this result 'total_duration'
        'total_duration': 'sum',  
        # get mean, call result 'average_duration'
        'average_duration': 'mean', 
        'num_calls': 'count'
    },
    # Now work on the "date" column
    'date': {     
        # Find the max, call the result "max_date" 
        'max_date': 'max',           
        'min_date': 'min',
        # Calculate the date range per group
        'num_days': lambda x: max(x) - min(x)  
    },
     # Calculate two results for the 'network' column with a list
    'network': ["count", "max"] 
}
# Perform groupby aggregation by "month", 
# but only on the rows that are of type "call"
data[data['item'] == 'call'].groupby('month').agg(aggregations)

C:\Users\vijayyadav\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\groupby\generic.py:1315: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

              duration                                           date  \
        total_duration average_duration num_calls            max_date
month
2014-11        25547.0       238.757009       107 2014-12-11 19:01:00
2014-12        13561.0       171.658228        79 2014-12-14 19:54:00
2015-01        17070.0       193.977273        88 2015-12-01 18:23:00
2015-02        14416.0       215.164179        67 2015-09-02 17:54:00
2015-03        21727.0       462.276596        47 2015-12-02 20:51:00

                                              network
                   min_date          num_days   count        max
month
2014-11 2014-01-11 15:13:00 334 days 03:48:00     107  voicemail
2014-12 2014-02-12 11:40:00 305 days 08:14:00      79  voicemail
2015-01 2014-12-15 20:03:00 350 days 22:20:00      88  voicemail
2015-02 2015-01-02 13:33:00 243 days 04:21:00      67  voicemail
2015-03 2015-01-03 12:19:00 333 days 08:32:00      47  voicemail